{"author": ["Stadius, Martin", "Lloyd, John Uri, 1849-1936", "McCracken, T. (Theresa)", "Hill, William E.", "Becher, Ronald, 1943-", "Michno, Gregory, 1948-", "Potucek, Martin, 1950-", "Gulick, Bill, 1916-2013", "Wilson, Rufus Rockwell, 1865-1949", "Nestor, Sandy", "Tamura, Teresa, 1960-", "Roe, JoAnn, 1926-", "McArthur, Scott", "Ramsey, Bruce A.", "Shewey, John", "Beemer, Rod, 1941-", "Cooper, Charles R.", "Barclay, James", "Beal, Merrill D., 1898-1990", "Lisk, Mark W.", "Medberry, Mike", "Miles, Jo N."], "publisher": ["Caxton Press,"], "subjects": ["Creffield Edmund 1867 1906, Church of the Bride of Christ", "Indians of North America Idaho, Pioneers Idaho, Mormons, Idaho History", "River life Idaho Salmon River Pictorial works, Wilderness areas Idaho Salmon River Valley Pictorial works, Salmon River Idaho Pictorial works, Salmon River Valley Idaho Pictorial works, Salmon River Idaho Description and travel, Salmon River Valley Idaho Description and travel", "Outlaws Northwest Pacific Biography Anecdotes, Frontier and pioneer life Northwest Pacific Anecdotes, Northwest Pacific Biography Anecdotes, Northwest Pacific History 19th century Anecdotes", "United States History Civil War 1861 1865 Statistics, United States History Civil War 1861 1865 Campaigns", "Minidoka Relocation Center History, Minidoka Relocation Center Pictorial works, Japanese Americans Evacuation and relocation 1942 1945, Japanese Americans Interviews, World War 1939 1945 Concentration camps Idaho, Concentration camps Idaho History, World War 1939 1945 Japanese Americans", "Natural disasters West U S History", "Names Indian Northwest Pacific, Names Indian Alaska, Names Geographical Northwest Pacific, Names Geographical Alaska, Northwest Pacific History Local, Alaska History Local", "Stadius Martin Travel Nez Perce National Historical Trail, Nez Perc‚ Indians History Guidebooks, Nez Perc‚ Indians Relocation, Nez Perce National Historical Trail Guidebooks, Nez Perce National Historical Trail Description and travel", "Inland water transportation Northwest Pacific History, River steamers Northwest Pacific History, Ship captains Northwest Pacific History, Inland water transportation Alaska History, River steamers Alaska History, Ship captains Alaska History", "Beaches Oregon Guidebooks, Oregon Guidebooks", "Northwest Pacific History 19th century, United States History Civil War 1861 1865", "Moses Felix 1827 1886", "Railroads Washington State Stevens Pass History, Outdoor recreation Washington State Stevens Pass History, Stevens Pass Wash History", "Depressions 1893 Washington State, Washington State History 1889, Washington State Economic conditions 19th century", "Historic sites Idaho, Trails Idaho History, Roads Idaho History, Historic sites Idaho Guidebooks, Trails Idaho Guidebooks, Roads Idaho Guidebooks, Automobile travel Idaho Guidebooks, Idaho History Local, Idaho Description and travel, Idaho Tours", "English language Dictionaries", "Kamiakin Yakama chief approximately 1800 approximately 1877 Military leadership, Wright George 1803 1865 Military leadership, Yakama Indians Wars 1855 1859, Yakama Indians Kings and rulers Biography, Yakama Indians History 19th century, Washington State History Military 19th century, Yakima River Valley Wash History Military 19th century", "Lincoln Abraham 1809 1865", "Lewis and Clark National Historic Trail Guidebooks, West U S Guidebooks, Lewis and Clark Expedition 1804 1806, West U S Description and travel", "Tracy Harry 1870 1902, Criminals Northwest Pacific Biography, Prisoners Northwest Pacific Biography, Fugitives from justice Northwest Pacific", "Snake War 1864 1868, Paiute Indians Wars, Shoshoni Indians Wars", "Oregon National Historic Trail, Overland journeys to the Pacific, West U S History, West U S Guidebooks", "Cheyenne Indians Wars 1864, Cheyenne Indians Wars Nebraska, Frontier and pioneer life Nebraska 19th century", "Medberry Mike Health, Cerebrovascular disease Patients Rehabilitation, Cerebrovascular disease Patients Idaho Biography, Craters of the Moon National Monument Idaho"], "itemtype": ["acbk", "arbk"], "itemcollection": ["cagr", "cabr", "cs6", "canf", "nanf", "cs6r", "casea", "caref"], "itemlocation": ["swt", "cen", "bal"]}